/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 1 / 44  - Метод forEach(callback) */

/* *************************************************************************** */
function calculateTotalPrice(orderedItems) {
  let totalPrice = 0;
  // Пиши код ниже этой строки

  orderedItems.forEach((orderedItem) => {
    totalPrice += orderedItem;
  });

  // Пиши код выше этой строки
  return totalPrice;
}
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 2 / 44  - Задача. Фильтрация массива чисел */

/* *************************************************************************** */
function filterArray(numbers, value) {
  const filteredNumbers = [];
  // Пиши код ниже этой строки

  numbers.forEach((number) => {
    if (number > value) {
      filteredNumbers.push(number);
    }
  });

  // Пиши код выше этой строки
  return filteredNumbers;
}
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 3 / 44  - Задача. Общие элементы */

/* *************************************************************************** */
function getCommonElements(firstArray, secondArray) {
  const commonElements = [];
  // Пиши код ниже этой строки

  firstArray.forEach((item) => {
    if (secondArray.includes(item)) {
      commonElements.push(item);
    }
  });

  return commonElements;
  // Пиши код выше этой строки
}
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 4 / 44  - Стрелочные функции. */

/* *************************************************************************** */
// Пиши код ниже этой строки

const calculateTotalPrice = (quantity, pricePerItem) => {
  // Пиши код выше этой строки
  return quantity * pricePerItem;
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 5 / 44  - Неявный возврат */

/* *************************************************************************** */
// Пиши код ниже этой строки
const calculateTotalPrice = (quantity, pricePerItem) => quantity * pricePerItem;
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 6 / 44  - Стрелочные функции как коллбеки */

/* *************************************************************************** */
// Пиши код ниже этой строки
const calculateTotalPrice = (orderedItems) => {
  let totalPrice = 0;

  orderedItems.forEach((item) => {
    totalPrice += item;
  });

  return totalPrice;
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 7 / 44  - Задача. Фильтрация массива чисел 2.0 */

/* *************************************************************************** */
// Пиши код ниже этой строки
const filterArray = (numbers, value) => {
  const filteredNumbers = [];

  numbers.forEach((number) => {
    if (number > value) {
      filteredNumbers.push(number);
    }
  });

  // Пиши код выше этой строки
  return filteredNumbers;
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 8 / 44  - Задача. Общие элементы 2.0 */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getCommonElements = (firstArray, secondArray) => {
  const commonElements = [];

  firstArray.forEach((element) => {
    if (secondArray.includes(element)) {
      commonElements.push(element);
    }
  });

  // Пиши код выше этой строки
  return commonElements;
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 9 / 44  - Чистые функции */

/* *************************************************************************** */
function changeEven(numbers, value) {
  // Пиши код ниже этой строки

  const newArray = [];

  numbers.forEach((number) => {
    if (number % 2 === 0) {
      newArray.push(number + value);
    } else {
      newArray.push(number);
    }
  });

  return newArray;
  // Пиши код выше этой строки
}
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 10 / 44  - Метод map() */

/* *************************************************************************** */
const planets = ["Земля", "Марс", "Венера", "Юпитер"];
// Пиши код ниже этой строки
const planetsLengths = planets.map((planet) => planet.length);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 11 / 44  - Метод map() и массив объектов */

/* *************************************************************************** */
const books = [
  { title: "Последнее королевство", author: "Бернард Корнуэлл", rating: 8.38 },
  { title: "На берегу спокойных вод", author: "Роберт Шекли", rating: 8.51 },
  { title: "Сон смешного человека", author: "Федор Достоевский", rating: 7.75 },
  { title: "Красна как кровь", author: "Ли Танит", rating: 7.94 },
  { title: "Враг Божий", author: "Бернард Корнуэлл", rating: 8.67 },
];
// Пиши код ниже этой строки

const titles = books.map((book) => book.title);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 12 / 44  - Метод flatMap() */

/* *************************************************************************** */
const books = [
  {
    title: "Последнее королевство",
    author: "Бернард Корнуэлл",
    genres: ["приключения", "историческое"],
  },
  {
    title: "На берегу спокойных вод",
    author: "Роберт Шекли",
    genres: ["фантастика"],
  },
  {
    title: "Красна как кровь",
    author: "Ли Танит",
    genres: ["ужасы", "мистика"],
  },
];
// Пиши код ниже этой строки

const genres = books.flatMap((book) => book.genres);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 13 / 44  - Задача. Имена пользователей */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getUserNames = (users) => {
  return users.map((user) => user.name);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 14 / 44  - Задача. Почты пользователей */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getUserEmails = (users) => {
  return users.map((user) => user.email);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 15 / 44 - Методы filter и find */

/* *************************************************************************** */
const numbers = [17, 24, 82, 61, 36, 18, 47, 52, 73];
// Пиши код ниже этой строки

const evenNumbers = numbers.filter((number) => number % 2 === 0);
const oddNumbers = numbers.filter((number) => number % 2 === 1);
/* *************************************************************************** */

/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 16 / 44  - Фильтрация уникальных элементов */

/* *************************************************************************** */
const books = [
  {
    title: "Последнее королевство",
    author: "Бернард Корнуэлл",
    genres: ["приключения", "историческое"],
  },
  {
    title: "На берегу спокойных вод",
    author: "Роберт Шекли",
    genres: ["фантастика", "мистика"],
  },
  {
    title: "Красна как кровь",
    author: "Ли Танит",
    genres: ["ужасы", "мистика", "приключения"],
  },
];
// Пиши код ниже этой строки
const allGenres = books.flatMap((book) => book.genres);
const uniqueGenres = allGenres.filter(
  (genre, index, array) => array.indexOf(genre) === index
);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 17 / 44  - Метод filter() и массив объектов */

/* *************************************************************************** */
const books = [
  { title: "Последнее королевство", author: "Бернард Корнуэлл", rating: 8.38 },
  { title: "На берегу спокойных вод", author: "Роберт Шекли", rating: 8.51 },
  { title: "Сон смешного человека", author: "Федор Достоевский", rating: 7.75 },
  { title: "Красна как кровь", author: "Ли Танит", rating: 7.94 },
  { title: "Враг Божий", author: "Бернард Корнуэлл", rating: 8.67 },
];

const MIN_RATING = 8;
const AUTHOR = "Бернард Корнуэлл";
// Пиши код ниже этой строки

const topRatedBooks = books.filter((book) => book.rating >= MIN_RATING);
const booksByAuthor = books.filter((book) => book.author === AUTHOR);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 18 / 44  - Задача. Пользователи с цветом глаз */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getUsersWithEyeColor = (users, color) => {
  const newArray = [];

  users.filter((user) => {
    if (user.eyeColor === color) {
      newArray.push(user);
    }
  });
  return newArray;
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 19 / 44  - Задача. Пользователи в возрастной категории */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getUsersWithAge = (users, minAge, maxAge) => {
  const averageAge = [];

  users.filter((user) => {
    if (user.age >= minAge && user.age < maxAge) {
      averageAge.push(user);
    }
  });

  return averageAge;
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 20 / 44  - Задача. Пользователи с другом */

/* *************************************************************************** */
const getUsersWithFriend = (users, friendName) => {
  const usersWithFriend = [];

  users.filter((user) => {
    if (user.friends.includes(friendName)) {
      usersWithFriend.push(user);
    }
  });

  return usersWithFriend;
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 21 / 44  - Задача. Список друзей */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getFriends = (users) => {
  return users
    .flatMap((user) => user.friends)
    .filter((friend, index, array) => array.indexOf(friend) === index);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 22 / 44  - Задача. Активные пользователи */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getActiveUsers = (users) => {
  return users.filter((user) => user.isActive);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 23 / 44  - Задача. Неактивные пользователи */

/* *************************************************************************** */
const getInactiveUsers = (users) => {
  return users.filter((user) => !user.isActive);
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 24 / 44  - Метод find() */

/* *************************************************************************** */
const books = [
  { title: "Последнее королевство", author: "Бернард Корнуэлл", rating: 8.38 },
  { title: "На берегу спокойных вод", author: "Роберт Шекли", rating: 8.51 },
  { title: "Сон смешного человека", author: "Федор Достоевский", rating: 7.75 },
  { title: "Красна как кровь", author: "Ли Танит", rating: 7.94 },
];
const BOOK_TITLE = "Сон смешного человека";
const AUTHOR = "Роберт Шекли";
// Пиши код ниже этой строки

const bookWithTitle = books.find((book) => book.title === BOOK_TITLE);
const bookByAuthor = books.find((book) => book.author === AUTHOR);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 25 / 44  - Задача. Пользователь с почтой */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getUserWithEmail = (users, email) => {
  return users.find((user) => user.email === email);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 26 / 44  - Метод every() */

/* *************************************************************************** */
const firstArray = [26, 94, 36, 18];
const secondArray = [17, 61, 23];
const thirdArray = [17, 26, 94, 61, 36, 23, 18];
// Пиши код ниже этой строки

const eachElementInFirstIsEven = firstArray.every((value) => value % 2 === 0);
const eachElementInFirstIsOdd = firstArray.every((value) => value % 2 === 1);

const eachElementInSecondIsEven = secondArray.every((value) => value % 2 === 0);
const eachElementInSecondIsOdd = secondArray.every((value) => value % 2 === 1);

const eachElementInThirdIsEven = thirdArray.every((value) => value % 2 === 0);
const eachElementInThirdIsOdd = thirdArray.every((value) => value % 2 === 1);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 27 / 44  - Задача. Все ли пользователи активны */

/* *************************************************************************** */
// Пиши код ниже этой строки
const isEveryUserActive = (users) => {
  return users.every((active) => active.isActive);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 28 / 44  - Метод some() */

/* *************************************************************************** */
const firstArray = [26, 94, 36, 18];
const secondArray = [17, 61, 23];
const thirdArray = [17, 26, 94, 61, 36, 23, 18];
// Пиши код ниже этой строки

const anyElementInFirstIsEven = firstArray.some((value) => value % 2 === 0);
const anyElementInFirstIsOdd = firstArray.some((value) => value % 2 === 1);

const anyElementInSecondIsEven = secondArray.some((value) => value % 2 === 0);
const anyElementInSecondIsOdd = secondArray.some((value) => value % 2 === 1);

const anyElementInThirdIsEven = thirdArray.some((value) => value % 2 === 0);
const anyElementInThirdIsOdd = thirdArray.some((value) => value % 2 === 1);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 29 / 44  - Задача. Есть ли активные пользователи */

/* *************************************************************************** */
// Пиши код ниже этой строки
const isAnyUserActive = (users) => {
  return users.some((active) => active.isActive);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 30 / 44 - Метод reduce() */

/* *************************************************************************** */
const players = {
  mango: 1270,
  poly: 468,
  ajax: 710,
  kiwi: 244,
};
const playtimes = Object.values(players); // [1270, 468, 710, 244]
// Пиши код ниже этой строки

const totalPlayTime = playtimes.reduce((previousValue, number) => {
  return previousValue + number;
}, 0);

// Пиши код выше этой строки
const averagePlayTime = totalPlayTime / playtimes.length;
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 31 / 44  - Метод reduce() и массив объектов */

/* *************************************************************************** */
const players = [
  { name: "Манго", playtime: 1270, gamesPlayed: 4 },
  { name: "Поли", playtime: 469, gamesPlayed: 2 },
  { name: "Аякс", playtime: 690, gamesPlayed: 3 },
  { name: "Киви", playtime: 241, gamesPlayed: 1 },
];
// Пиши код ниже этой строки

const totalAveragePlaytimePerGame = players.reduce((total, player) => {
  return total + player.playtime / player.gamesPlayed;
}, 0);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 32 / 44  - Задача. Общий баланс пользователей */

/* *************************************************************************** */
const calculateTotalBalance = (users) => {
  return users.reduce((total, user) => total + user.balance, 0);
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 33 / 44  - Задача. Общее количество друзей */

/* *************************************************************************** */
const getTotalFriendCount = (users) => {
  return users.reduce((total, user) => total + user.friends.length, 0);
};
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 34 / 44  - Метод sort() */

/* *************************************************************************** */
const releaseDates = [2016, 1967, 2008, 1984, 1973, 2012, 1997];
const authors = [
  "Ли Танит",
  "Бернард Корнуэлл",
  "Роберт Шекли",
  "Федор Достоевский",
];
// Пиши код ниже этой строки

const ascendingReleaseDates = [...releaseDates].sort();

const alphabeticalAuthors = [...authors].sort();
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 35 / 44  - Свой порядок сортировки чисел */

/* *************************************************************************** */
const releaseDates = [2016, 1967, 2008, 1984, 1973, 2012, 1997];
// Пиши код ниже этой строки

const ascendingReleaseDates = [...releaseDates].sort((a, b) => a - b);

const descendingReleaseDates = [...releaseDates].sort((a, b) => b - a);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 36 / 44  - Свой порядок сортировки строк */

/* *************************************************************************** */
const authors = [
  "Ли Танит",
  "Бернард Корнуэлл",
  "Роберт Шекли",
  "Федор Достоевский",
  "Говард Лавкрафт",
];
// Пиши код ниже этой строки

const authorsInAlphabetOrder = [...authors].sort((a, b) => a.localeCompare(b));

const authorsInReversedOrder = [...authors].sort((a, b) => b.localeCompare(a));
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 37 / 44  - Сортировка объектов */

/* *************************************************************************** */
const books = [
  { title: "Последнее королевство", author: "Бернард Корнуэлл", rating: 8.38 },
  { title: "На берегу спокойных вод", author: "Роберт Шекли", rating: 8.51 },
  { title: "Сон смешного человека", author: "Федор Достоевский", rating: 7.75 },
  { title: "Красна как кровь", author: "Ли Танит", rating: 7.94 },
  { title: "Враг Божий", author: "Бернард Корнуэлл", rating: 8.67 },
];
// Пиши код ниже этой строки

const sortedByAuthorName = [...books].sort((firstBook, secondBook) =>
  firstBook.author.localeCompare(secondBook.author)
);

const sortedByReversedAuthorName = [...books].sort((firstBook, secondBook) =>
  secondBook.author.localeCompare(firstBook.author)
);

const sortedByAscendingRating = [...books].sort(
  (firstBook, secondBook) => firstBook.rating - secondBook.rating
);

const sortedByDescentingRating = [...books].sort(
  (firstBook, secondBook) => secondBook.rating - firstBook.rating
);
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 38 / 44  - Задача. Сортировка по балансу */

/* *************************************************************************** */
// Пиши код ниже этой строки
const sortByAscendingBalance = (users) => {
  return [...users].sort(
    (firstUser, secondUser) => firstUser.balance - secondUser.balance
  );
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 39 / 44  - Задача. Сортировка по количеству друзей */

/* *************************************************************************** */
// Пиши код ниже этой строки
const sortByDescendingFriendCount = (users) => {
  return [...users].sort(
    (firstUser, secondUser) =>
      secondUser.friends.length - firstUser.friends.length
  );
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 40 / 44  - Задача. Сортировка по имени */

/* *************************************************************************** */
// Пиши код ниже этой строки
const sortByName = (users) => {
  return [...users].sort((firstUser, secondUser) =>
    firstUser.name.localeCompare(secondUser.name)
  );
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 41 / 44  - Цепочки методов (чейнинг, chaining) */

/* *************************************************************************** */
const books = [
  { title: "Последнее королевство", author: "Бернард Корнуэлл", rating: 8.38 },
  { title: "На берегу спокойных вод", author: "Роберт Шекли", rating: 8.51 },
  { title: "Сон смешного человека", author: "Федор Достоевский", rating: 7.75 },
  { title: "Красна как кровь", author: "Ли Танит", rating: 8.14 },
  { title: "Сны В Ведьмином Доме", author: "Говард Лавкрафт", rating: 8.67 },
];
const MIN_BOOK_RATING = 8;
// Пиши код ниже этой строки

const names = books
  .filter((book) => book.rating > MIN_BOOK_RATING)
  .flatMap((book) => book.author)
  .sort((firstAuthor, secondAuthor) => firstAuthor.localeCompare(secondAuthor));
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 42 / 44  -  */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getNamesSortedByFriendCount = (users) => {
  return [...users]
    .sort(
      (firstUser, secondUser) =>
        firstUser.friends.length - secondUser.friends.length
    )
    .map((user) => user.name);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 43 / 44  - Задача. Имена друзей */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getSortedFriends = (users) => {
  return users
    .flatMap((user) => user.friends)
    .filter((friend, index, array) => array.indexOf(friend) === index)
    .sort((a, b) => a.localeCompare(b));
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */

/* Задача 44 / 44  - Задача. Общий баланс */

/* *************************************************************************** */
// Пиши код ниже этой строки
const getTotalBalanceByGender = (users, gender) => {
  return [...users]
    .filter((user) => user.gender === gender)
    .reduce((total, user) => total + user.balance, 0);
};
// Пиши код выше этой строки
/* *************************************************************************** */
/* **************************************************************************** */
